<?php
//2019年から 5 年先まで
$from_year = 2019;
$to_year = (int)date('Y',strtotime("+5 year"));
$year[''] = '—';
for( $i = $from_year; $i <= $to_year; $i++ ){
    $year[$i] = $i;
}

//1月から12月まで
$month[''] = '—';
for( $i = 1; $i <= 12; $i++ ){
    $month[sprintf("%02d", $i)] = sprintf("%02d", $i);
}

//1日から31日まで
$day[''] = '—';
for( $i = 1; $i <= 31; $i++ ){
    $day[sprintf("%02d", $i)] = sprintf("%02d", $i);
}

//01時から24時まで
$hour[''] = '—';
for( $i = 0; $i <= 23; $i++ ){
    $hour[sprintf("%02d", $i)] = sprintf("%02d", $i);
}

//00分から59分まで
$Minutes[''] = '—';
for( $i = 0; $i <= 59; $i++ ){
    $Minutes[sprintf("%02d", $i)] = sprintf("%02d", $i);
}

$interview_time_minutes[''] = '—';
for( $i = 0; $i <= 50; $i = $i+10 ){
    $interview_time_minutes[sprintf("%02d", $i)] = sprintf("%02d", $i);
}


//現在の年月日
$now_date['Y'] = (string)date('Y');
$now_date['M'] = (string)date('m');
$now_date['D'] = (string)date('d');
$now_date['H'] = (string)date('H');
$now_date['I'] = (string)date('i');

$scout[''] = '—';
for( $i = 1; $i <= 100; $i++ ){
    $scout[$i] = $i;
}

$day_year[''] = '—';
for( $i = 0; $i <= 365; $i++ ){
    $day_year[$i] = $i;
}
return array(
    'metaData' => array(),
    'hidden_flag' => array(
        '1' => '公開',
        '0' => '非公開'
    ),
    'apply' => array(
        "" => "-",
        1 => "電話",
        2 => "LINE",
        3 => "メール",
//        4 => "サイト",
        5 => "チャット",
        6 => "飛び込み",
        7 => "店舗直電",
        4 => "サイト（梅田）",
        8 => "サイト（京橋）",
        9 => "サイト（難波）",
        10 => "サイト（日本橋）",
        11 => "サイト（天王寺）",
        12 => "サイト（谷町9丁目）",
        13 => "サイト（グループ梅田）",
        14 => "サイト（グループ難波）",
        15 => "サイト（グループ日本橋）",
   ),
    'year'	=> $year,
    'month'	=> $month,
    'day'	=> $day,
    'day_year'	=> $day_year,
    'week'	=> array(
        0 => '日',
        1 => '月',
        2 => '火',
        3 => '水',
        4 => '木',
        5 => '金',
        6 => '土',
    ),
    'cup_data' => array(
        "" => "—",
        "A" => "A",
        "B" => "B",
        "C" => "C",
        "D" => "D",
        "E" => "E",
        "F" => "F",
        "G" => "G",
        "H" => "H",
        "I" => "I",
        "I" => "I",
        "J" => "J",
        "K" => "K",
    ),
    'now_date' => $now_date,
    'hour'	=>	$hour,
    'Minutes'	=>	$Minutes,
    'Switching_time'	=>	5,
    'interview_time_minutes' => $interview_time_minutes,
    'master_mail' => 'recruit@labelle-osaka.com',
    'master_page' => array(
        'belonging_store' => '店舗登録',
        'staff'     => 'スタッフ＋メールアドレス',
        'group'     => 'グループ',
        'publicity' => '掲載広告名',
        'genre'     => '掲載業種',
        'media'     => '掲載求人名',
        'area'      => '広告掲載エリア',
        'check'     => '確認状況',
        'place'     => '待ち合わせ場所',
        'word'      => '検索ワード',
        'person'    => '身分証',
        'experience' => '職歴',
        'work'      => '勤務形態',
        'interviewshop'      => '面接店舗',
        'maildomain'   => 'メールドメイン',
        'another_shop' => '他店紹介先',
        'reason'    => '追跡理由',
        'contact'   => '連絡方法',
        'interview_result'   => '面接結果',
        'leaving_reason'   => '退店理由',
        'move'      => '出戻・移籍 etc',
    ),
    'tentative_reserve_flg' => array(1 => ""),
    'scout' => $scout,
    'leaving_reason' => array(
        "" => "—",
        "1" => "音信不通",
        "2" => "目標達成",
        "3" => "就職",
        "4" => "結婚",
        "5" => "稼げない",
        "6" => "身バレ"
    ),
    'pref' => array(
        '近畿' => array(
            '24'=>'三重県',
            '25'=>'滋賀県',
            '26'=>'京都府',
            '27'=>'大阪府',
            '28'=>'兵庫県',
            '29'=>'奈良県',
            '30'=>'和歌山県'
        ),
        '北海道' => array(
            '1'=>'北海道'
        ),
        '東北' => array(
            '2'=>'青森県',
            '3'=>'岩手県',
            '4'=>'宮城県',
            '5'=>'秋田県',
            '6'=>'山形県',
            '7'=>'福島県'
        ),
        '関東' => array(
            '8'=>'茨城県',
            '9'=>'栃木県',
            '10'=>'群馬県',
            '11'=>'埼玉県',
            '12'=>'千葉県',
            '13'=>'東京都',
            '14'=>'神奈川県'
        ),
        '中部' => array(
            '15'=>'新潟県',
            '16'=>'富山県',
            '17'=>'石川県',
            '18'=>'福井県',
            '19'=>'山梨県',
            '20'=>'長野県',
            '21'=>'岐阜県',
            '22'=>'静岡県',
            '23'=>'愛知県'
        ),
        '中国' => array(
            '31'=>'鳥取県',
            '32'=>'島根県',
            '33'=>'岡山県',
            '34'=>'広島県',
            '35'=>'山口県'
        ),
        '四国' => array(
            '36'=>'徳島県',
            '37'=>'香川県',
            '38'=>'愛媛県',
            '39'=>'高知県'
        ),
        '九州' => array(
            '40'=>'福岡県',
            '41'=>'佐賀県',
            '42'=>'長崎県',
            '43'=>'熊本県',
            '44'=>'大分県',
            '45'=>'宮崎県',

            '46'=>'鹿児島県'
        ),
        '沖縄' => array(
            '47'=>'沖縄県'
        ),
    ),
    'pref_name' => array(
        '24'=>'三重県',
        '25'=>'滋賀県',
        '26'=>'京都府',
        '27'=>'大阪府',
        '28'=>'兵庫県',
        '29'=>'奈良県',
        '30'=>'和歌山県',
        '1'=>'北海道',
        '2'=>'青森県',
        '3'=>'岩手県',
        '4'=>'宮城県',
        '5'=>'秋田県',
        '6'=>'山形県',
        '7'=>'福島県',
        '8'=>'茨城県',
        '9'=>'栃木県',
        '10'=>'群馬県',
        '11'=>'埼玉県',
        '12'=>'千葉県',
        '13'=>'東京都',
        '14'=>'神奈川県',
        '15'=>'新潟県',
        '16'=>'富山県',
        '17'=>'石川県',
        '18'=>'福井県',
        '19'=>'山梨県',
        '20'=>'長野県',
        '21'=>'岐阜県',
        '22'=>'静岡県',
        '23'=>'愛知県',
        '31'=>'鳥取県',
        '32'=>'島根県',
        '33'=>'岡山県',
        '34'=>'広島県',
        '35'=>'山口県',
        '36'=>'徳島県',
        '37'=>'香川県',
        '38'=>'愛媛県',
        '39'=>'高知県',
        '40'=>'福岡県',
        '41'=>'佐賀県',
        '42'=>'長崎県',
        '43'=>'熊本県',
        '44'=>'大分県',
        '45'=>'宮崎県',
        '46'=>'鹿児島県',
        '47'=>'沖縄県'
    ),
    'interview_result' => array(
        "" => "—",
        "1" => "採用",
        "2" => "不採用",
        "3" => "撃沈",
        "4" => "他店紹介不採用",
        "5" => "他店紹介撃沈"
    ),
    'interview_result_peas' => array(
        "1" => "採用",
        "2" => "不採用",
        "3" => "撃沈"
    ),
    'work' => array(
        "" => "—",
        "1" => "早番",
        "2" => "中番",
        "3" => "遅番",
        "4" => "深夜",
    ),

    'work_location' => array(
        '1' => '梅田',
        '2' => '難波',
        '3' => '京橋',
        '4' => '天王寺',
        '5' => '日本橋',
        '6' => '谷九'
    ),

    'hope_workplace' => array(
        '1' => "希望なし",
        '2' => '梅田',
        '3' => '京橋',
        '4' => '難波',
        '5' => '日本橋',
        '6' => '天王寺',
        '7' => '谷九'
    ),

    'confirmation_chk' => array(
        '1' => "社員確認済",
        '2' => '深夜判断',
        '3' => '不採用履歴確認済',
        '4' => '採用通知確認済',
    ),

    'ipSetArrowList' => array(
        "221.113.41.190" ,
        "114.172.168.136" ,
        "116.58.172.198" ,
        "113.150.232.42" ,
        "110.5.26.104" ,
        "110.5.24.178" ,
        "110.5.24.192" ,
        "110.5.24.152" ,
        "220.157.181.68" ,
        "210.253.225.40" ,
        "183.77.124.123" ,
        "153.246.191.87" ,
        "110.5.24.161" ,
        "153.246.191.86" ,
        "118.243.57.1" ,
        "110.5.24.190" ,
        "110.5.24.159" ,
        "110.5.24.194" ,
        "110.5.24.155" ,
        "133.32.181.200" ,
        "60.236.29.41" ,
        "210.188.245.226" ,
    )
);